# To keep this file in sync I'm avoiding to install with the `brew install` command,
# instead I'm adding a row to this file and run 'brew bundle --global' to make sure it's working.

# https://github.com/Homebrew/homebrew-bundle
# Always run 'brew update' before running 'brew bundle'

#
# It's not always easy to understand how the dsl for bundle is constructed without reading the code.
# I know people have asked for clarification in the documentation but it has not been
# well received by {noname}. Haven't found any changelog either but heck, it's open source ;-)
#

def macos?
  RUBY_PLATFORM =~ /darwin/
end
def linux?
  RUBY_PLATFORM =~ /linux/
end
def arch_amd?
  RUBY_PLATFORM =~ /amd/
end
def arch_arm?
  RUBY_PLATFORM =~ /arm/
end

### ---------------------------------------------------- ###
### Taps
### ---------------------------------------------------- ###

### ---------------------------------------------------- ###
### Development Runtimes & SDKs
### ---------------------------------------------------- ###
brew "go"                                           # golang sdk
brew "java"                                         # java
brew "lua"                                          # a powerful, efficient, lightweight, embeddable scripting language
brew "nvm"                                          # manage multiple Node.js versions
brew "php"                                          # php
brew "python"                                       # python programming
brew "pip-completion"
brew "ruby"                                         # ruby environment
brew "rustup-init"                                  # rustup installer
brew "oven-sh/bun/bun"                              # fast JavaScript runtime, bundler, test runner, and package manager
cask "flutter"                                      # ui toolkit for flutter

### ---------------------------------------------------- ###
### Build Tools, Analysis & Linters
### ---------------------------------------------------- ###
brew "cmake"                                        # cross-platform make
brew "cloc"                                         # count lines of code
brew "doxygen"                                      # Generate documentation from source code
brew "flake8"                                       # lint python
brew "go-task/tap/go-task"                          # task runner / build tool
brew "golangci-lint"                                # Go linters aggregator
brew "goreleaser"                                   # release automation tool for Go projects
brew "luarocks"                                     # lua package manager
brew "maven-completion"                             # maven-completion
brew "mthmulders/tap/mcs"                           # search maven central cli
brew "semgrep"                                      # static analysis, find bugs and enforce code standards
brew "shellcheck"                                   # a static analysis tool for shell scripts
brew "statix"                                       # linter for nix
brew "stylua"                                       # lua formatter
brew "yarn"                                         # JavaScript package manager

### ---------------------------------------------------- ###
### HTTP/REST/GrapgQL Clients
### ---------------------------------------------------- ###
cask "bruno"                                        # opensource ide for exploring and testing api's
cask "insomnia"                                     # superduper rest client
cask "postman"                                      # nice rest client
cask "soapui"                                       # soap and rest testing tool
cask "yaak"                                         # rest/graphql api client
brew "k6"                                           # open-source load testing tool

### ---------------------------------------------------- ###
### AI & Machine Learning Tools
### ---------------------------------------------------- ###
brew "aider"                                        # ai, vibe-coding
brew "charmbracelet/tap/crush"                      # AI coding agent for your terminal f.k.a opencode
brew "charmbracelet/tap/mods"                       # AI on the command line
brew "arimxyer/tap/models"                          # tui for browsing ai models
brew "gemini-cli"                                   # gemini prompt in the terminal
brew "sst/tap/opencode"                             # AI agent for the terminal
brew "mostlygeek/llama-swap/llama-swap"             # model swapping for any local llm-server
brew "ollama"                                       # create, run, and share large language models (llms)
brew "alexsjones/llmserve/llmserve"                 # simple tui for serving local llm models
brew "llmfit"                                       # find wich llm models runs on your hardware

### ---------------------------------------------------- ###
### DevOps, Containers & Kubernetes
### ---------------------------------------------------- ###
brew "act"                                          # run your github actions locally
brew "ansible"                                      # IaC provision and configure
brew "argocd"                                       # GitOps continuous delivery tool for Kubernetes
brew "boz/repo/kail"                                # kubernetes log viewer
brew "ctop"                                         # top-like interface for container metrics
brew "merikan/tools/clair-scanner"                  # scan local docker images
brew "dive"                                         # exploring a docker image, layer contents, and discovering ways to shrink your Docker image size.
brew "docker"                                       # docker client
brew "docker-credential-helper"                     # keystore credential helper for Docker
brew "helm"                                         # helm packagemanager for kubernetes
brew "jesseduffield/lazydocker/lazydocker"          # the lazier way to manage everything docker
brew "johanhaleby/kubetail/kubetail"                # tail Kubernetes logs from multiple pods
brew "k3d"                                          # k3d is a lightweight wrapper to run k3s
brew "k9s"                                          # awesome tui for k8s
brew "kind"                                         # k8s in docker
brew "janosmiko/tap/lfk"                            # yazi-inspired tui for k8s
cask "rancher"                                      # OSS alternative to Docker Desktop
brew "kompose"                                      # a conversion tool to go from Docker Compose to Kubernetes
brew "krew"                                         # package manager for kubectl plugins
brew "kubectl"                                      # kubernetes controller
brew "kubectx"                                      # kubectx: manage and switch between kubectl contexts, kubens: switch between Kubernetes namespaces.
brew "kubeconform"                                  # lint k8s manifests
brew "kubeseal"                                     # Kubernetes tool for one-way encrypted Secrets
brew "kube-linter"                                  # lint k8s and helm manifests
brew "kubespy"                                      # observing Kubernetes resources in real time
brew "kustomize"                                    # kustomize: template-free customization of application configuration
brew "minikube"                                     # kubernetes mini
brew "openshift-cli"                                # openshift cli
brew "podman"                                       # tool for managing oci containers and pods
brew "skaffold"                                     # local k8s development
brew "skopeo"                                       # work with container registry and images
brew "stern"                                        # log tailing for Kubernetes
brew "vmware-tanzu/carvel/ytt"                      # YAML templating tool, structure instead of text
brew "devcontainer"                                 # devcontainer cli
cask "devpod"                                       # an implementation of devcontainers
cask "docker-desktop"                               # docker desktop
cask "podman-desktop"                               # Browse, manage, inspect containers and images

### ---------------------------------------------------- ###
### Editors & IDEs
### ---------------------------------------------------- ###
brew "neovim"                                       # neovim
brew "vim"                                          # highly configurable text editor
brew "helix"                                        # neovim inspired text editor written in rust
cask "android-studio"                               # android IDE
cask "eclipse-java"                                 # eclipse ide for java developers
cask "intellij-idea"                                # awesome java IDE
cask "neovide-app"                                  # a gui for neovim
cask "sublime-text"                                 # text editor
cask "visual-studio-code"                           # a great editor
cask "vscodium"                                     # open source version of VSCode
cask "zed"                                          # multiplayer code editor

### ---------------------------------------------------- ###
### Git & Source Control
### ---------------------------------------------------- ###
brew "difi"                                         # a nice diff viewe
brew "CJ-Systems/homebrew-gitflow-cjs/git-flow-cjs" # git-flow addon for git client
brew "gh"                                           # github cli
brew "ghq"                                          # git remote repository management made easy
brew "gibo"                                         # easily accessing gitignore boilerplates
brew "git"                                          # cli client for git
brew "git-branchless"                               # some nice git commands
brew "git-delta"                                    # syntax-highlighting pager for git, diff, and grep output
brew "git-graph"                                    # nice git graph
brew "k1LoW/tap/git-wt"                             # git worktrees like a pro
brew "gitui"                                        # an awesome tui for git
brew "glab"                                         # gitlab cli
brew "jesseduffield/lazygit/lazygit"                # simple terminal UI for git commands
brew "lefthook"                                     # a fast git hook manager
brew "onefetch"                                     # git project information tool
brew "sigstore/tap/gitsign"                         # keyless sigstore to sign git commits
brew "tig"                                          # text-mode interface for git
cask "gitkraken"                                    # Git GUI client for Windows, Mac and Linux
cask "gitup-app"                                    # awesome Git Gui Client
cask "sourcetree"                                   # awesome git client

### ---------------------------------------------------- ###
### Terminal & Shell Environment
### ---------------------------------------------------- ###
brew "asciinema"                                    # record and share terminal sessions
brew "bash"                                         # bash
brew "bash-completion"                              # bash-completion
brew "reattach-to-user-namespace"                   # Reattach process (e.g., tmux) to background
brew "sheldon"                                      # fast, configurable, shell plugin manager
brew "starship"                                     # blazing-fast cross-shell prompt
brew "tmux"                                         # terminal multiplexer
brew "zellij"                                       # an awesome terminal multiplexer
brew "zimfw"                                        # the zsh configuration framework
brew "zsh"                                          # shell
cask "alacritty"                                    # the GPU enhanced terminal emulator
cask "ghostty"                                      # Terminal emulator that uses platform-native UI and GPU acceleration
cask "iterm2"                                       # Terminal emulator for macOS
cask "kitty"                                        # kitty terminal emulator
cask "wezterm"                                      # cross-platform terminal emulator

### ---------------------------------------------------- ###
### Security & Networking
### ---------------------------------------------------- ###
brew "aria2"                                        # multi-protocol & multi-source command-line download utility
brew "doganarif/tap/pf"                             # find open ports
brew "httpie"                                       # HTTP command-line client
brew "curl"                                         # curl
brew "openconnect"                                  # open client for cisco anyconnect vpn
brew "stunnel"                                      # SSL tunneling program
brew "subfinder"                                    # fast passive subdomain enumeration tool.
cask "tunnelblick"                                  # free, open source graphic user interface for OpenVPN
mas "Bredbandskollen", id: 1147976909
brew "ssh-copy-id"                                  # ssh copy

brew "anchore/grype/grype"                          # vulnerability scanner for container images and filesystems
brew "aquasecurity/trivy/trivy"                     # scanner for vulnerabilities in images, filesystems, git repos and config files
brew "bitwarden-cli"                                # open source password management
brew "cosign"                                       # code signing and transparency for containers and binaries
brew "fnox"                                         # cli secret manager
brew "betterleaks"                                  # a better secrets scanner
brew "gitleaks"                                     # audit git repos for secrets
brew "git-secrets"                                  # prevents you from committing passwords and other sensitive information to a git repository.
brew "gnupg"                                        # gpg
brew "nmap"                                         # port scanning utility for large networks
brew "scorecard"                                    # check OSS security health
brew "trufflehog"                                   # find and verify credentials #security #git
cask "bitwarden"                                    # open source password management
cask "keepassxc"                                    # a great FOSS Password Manager
cask "mitmproxy"                                    # a free and open source interactive HTTPS proxy
cask "zap"                                          # Zed Attack Proxy (web scanner)
brew "domcyrus/rustnet/rustnet"                     # per-process network monitoring

### ---------------------------------------------------- ###
### File & Data Management
### ---------------------------------------------------- ###

brew "util-linux"                                   # linux utilities
brew "zoxide"                                       # a smarter cd command
brew "lsd"                                          # a clone of ls with more features
brew "tree"                                         # list contents of directories in a tree-like format
brew "fd"                                           # fast and user-friendly alternative to find
brew "ripgrep"                                      # recursively searches directories for a regex pattern
brew "fzf"                                          # a command-line fuzzy finder
# filemangaer
brew "yazi"                                         # blazing fast terminal file manager
brew "superfile"                                    # another awesome tui filemanager
brew "joshuto"                                      # ranger-like terminal file manager written in Rust
brew "lf"                                           # file manager for the terminal
brew "midnight-commander"                           # visual file manager
# disk
brew "merikan/tools/gdu-go"                         # go disk usage
brew "ncdu"                                         # a disk usage analyzer with an ncurses interface
brew "dust"                                         # a better du built in rust
brew "dfc"                                          # displays file system space usage using graphs and colors
# compression
brew "7zip"                                         # file archiver with a high compression ratio
brew "unar"                                         # command-line unarchiving tools supporting multiple formats
# data-formats
brew "csvkit"                                       # tools for working with CSV
brew "dasel"                                        # query and modify data structures in json/toml/yaml/xml/csv/plain format
brew "fx"                                           # JSON/YAML viewer & processor
brew "gojq"                                         # jq written in go
brew "gron"                                         # make JSON greppable!
brew "jaq"                                          # like jq but better, faster and more correct
brew "jc"                                           # convert command output to json
brew "jid"                                          # drill down JSON interactively by using filtering queries like jq.
brew "jless"                                        # a command-line JSON viewer
brew "jmespath/jmespath/jp"                         # cli for jmespath
brew "jo"                                           # small utility to create JSON objects
brew "jq"                                           # command-line JSON processor, like sed
brew "wvanlint/twf/twf"                             # tree view file explorer
brew "xan"                                          # A fast csv command line toolkit written in Rust.
brew "yq"                                           # fast yaml processor
# other
brew "wget"                                         # non-interactive network downloader
brew "rsync"                                        # provides fast incremental file transfer.
brew "yt-dlp"                                       # download videos from youtube and many more sites
cask "android-file-transfer"                        # transfer files from Android device
cask "balenaetcher"                                 # Burn images to SD cards & USB drives, safely and easily.
cask "cyberduck"                                    # client for FTP and SFTP, WebDAV, and cloud storage

### ---------------------------------------------------- ###
### OS Productivity & Utilities
### ---------------------------------------------------- ###
brew "FelixKratz/formulae/borders", restart_service: :changed # add colored borders to user windows
brew "felixkratz/formulae/sketchybar"               # macOS status bar
brew "htop"                                         # an interactive process viewer for Unix
brew "mackup"                                       # keep application settings in sync
brew "mas"                                          # Mac App Store command-line interface
brew "procs"                                        # replacement for ps written by Rust
cask "sloth"                                        # shows all open files and sockets
brew "pstree"                                       # pstree
brew "watch"                                        # execute a program periodically and watch the output
brew "xdg-ninja"                                    # xdg checks your $HOME for unwanted files and directories.
cask "nikitabobko/tap/aerospace"                    # tiling window manager
cask "alfred"                                       # a must have for boost productivity
cask "alt-tab"                                      # awesome keyboard window switcher for Mac
cask "bartender"                                    # organize your menu bar icons
cask "hammerspoon"                                  # powerful automation of MacOS, actions and wm
cask "karabiner-elements"                           # keyboard customizer for macOS
cask "leader-key"                                   # a launcher for macos
cask "raycast"                                      # supercharged productivity
cask "tomatobar"                                    # another pomodoro app
cask "tonisives/tap/ovim"                           # system wide vim mode
cask "xbar"                                         # put the output from any script or program in your Mac OS X Menu Bar

### ---------------------------------------------------- ###
### Media & Design
### ---------------------------------------------------- ###
brew "mpv"                                          # Media player based on MPlayer and mplayer2
brew "ffmpeg"                                       # record, convert and stream audio and video
brew "ffmpegthumbnailer"                            # create thumbnails for your video files
brew "imagemagick"                                  # create, edit, compose, or convert bitmap images
brew "mplayer"                                      # UNIX movie player
brew "plantuml"                                     # draw UML diagrams
brew "potrace"                                      # transforming bitmaps into vector graphics
brew "scrcpy"                                       # android screen mirror
brew "structurizr-cli"                              # cli for Structurizr DSL
cask "gimp"                                         # an Image Editor (I probably never be able to learn)
cask "handbrake-app"                                # open source video transcoder
cask "horos"                                        # a free, open source medical image viewer
cask "inkscape"                                     # A powerful, free design tool
cask "obs"                                          # foss for video recording and live streaming
cask "paintbrush"                                   # clean and simple paint program
cask "pencil"                                       # open-source GUI prototyping tool
cask "phoenix-slides"                               # image viewer
cask "sketch"                                       # sketchapp - design tool
cask "sonos"                                        # controller for sonos speakers
cask "spotify"                                      # music for everyone
cask "vlc"                                          # media player
cask "merikan/casks/sr"                             # nativefied sveriges radio

### ---------------------------------------------------- ###
### Browsers, Communication & Notes
### ---------------------------------------------------- ###
# e-mail
brew "aerc"                                         # a tui email client in the terminal
cask "wavebox"                                      # desktop app for web (gmail)
cask "thunderbird"                                  # free email application from Mozilla
# mastodon
brew "toot"                                         # mastodon tui client
brew "tut"                                          # mastodon tui client
cask "whalebird"                                    # mastodon client
# note taking
cask "obsidian"                                     # awesome notetaking application
brew "joplin-cli"                                   # note taking and to-do application
cask "evernote"                                     # taking notes
cask "joplin"                                       # a FOSS note taking and to-do application
cask "qownnotes"                                    # nice rest client
# browser
brew "w3m"                                          # text base browser in the terminal
cask "brave-browser"                                # privacy focused, performance oriented browser
cask "firefox"                                      # firefox browser
cask "firefox@developer-edition"                    # firefox browser
cask "google-chrome"                                # a browser
cask "opera"                                        # browser
cask "responsively"                                 # modified web browser for responsive web development
cask "ungoogled-chromium"                           # open-source browser
cask "vivaldi"                                      # another great browser
cask "zen"                                          # a gecko based community driven browser
# other
cask "zoom"                                         # video communications
cask "adium"                                        # instant messaging
cask "discord"                                      # group-chatting platform

### ---------------------------------------------------- ###
### Virtualization & Databases
### ---------------------------------------------------- ###
brew "mysql-client"                                 # mysql client
cask "dbeaver-community"                            # universal database tool

cask "utm"                                          # virtual machines ui using qemu
cask "vagrant"                                      # vm management
cask "virtualbox"                                   # virtualizer for x86/arm hardware

### ---------------------------------------------------- ###
### Quick Look Plugins
### ---------------------------------------------------- ###
cask "qlcolorcode"                                  # preview source code files with syntax highlighting
cask "qlstephen"                                    # preview plain text files without or with unknown file extension.
cask "qlmarkdown"                                   # preview Markdown files
cask "quicklook-json"                               # preview JSON files
cask "quicklook-csv"                                # preview CSV files
cask "webpquicklook"                                # preview WebP images
cask "suspicious-package"                           # preview the contents of a standard Apple installer package
cask "qlvideo"                                      # display thumbnails, static previews, cover art and metadata for video files

### ---------------------------------------------------- ###
### Fonts
### ---------------------------------------------------- ###
cask "font-3270"                                    # a font for the nostalgic
cask "font-3270-nerd-font"                          # nerd patched '3270' font
cask "font-fira-code"                               # monospaced font with programming ligatures
cask "font-fira-code-nerd-font"                     # nerd patched 'fire-code' font
cask "font-go"                                      # golang fonts
cask "font-go-mono-nerd-font"                       # nerd patched 'go-mono' font
cask "font-hack-nerd-font"                          # Hack Nerd Font (Hack)
cask "font-hasklig"                                 # a code font with monospaced ligatures
cask "font-hasklug-nerd-font"                       # nerd patched 'hasklig' font
cask "font-inconsolata"                             # a great programmers font
cask "font-inconsolata-nerd-font"                    # nerd patched 'inconsolata' font
cask "font-jetbrains-mono"                          # a typeface made for developers.
cask "font-jetbrains-mono-nerd-font"                # nerd patched 'jetbrains-mono' font
cask "font-monoid"                                  # a ppen source coding font with ligatures
cask "font-monoid-nerd-font"                        # nerd patched 'monoid' font
cask "font-monoisome"                               # monoid with Font Awesome support

### ---------------------------------------------------- ###
### Miscellaneous Tools
### ---------------------------------------------------- ###
brew "apktool"                                      # reverse engineering Android apk files
brew "bat"                                          # a cat clone with syntax highlighting and git integration
brew "ccat"                                         # colorizing cat
brew "diff-pdf"                                     # visually compare two PDF files
brew "direnv"                                       # load/unload env variables
brew "fastfetch"                                    # A fast, highly customizable system info script
brew "hugo"                                         # open-source static site generator
brew "icdiff"                                       # improved colored diff
brew "jenv"                                         # manage your java environment
brew "lnav"                                         # watch and analyze your log files from a terminal.
brew "mise"                                         # handle dev environment
brew "peterldowns/tap/nix-search-cli"               # search nix packages
brew "poppler"                                      # pdf rendering library (based on the xpdf-3.0 code base)
brew "presenterm"                                   # presentations in markdown and run in termainl
brew "pv"                                           # a terminal-based tool for monitoring the progress of data through a pipeline.
brew "pyenv"                                        # simple python version management
brew "tealdeer"                                     # a fast tldr impl in rust with custom pages and patches
brew "the_silver_searcher"                          # ag a code searching tool similar to ack
cask "arq"                                          # backup for mac
cask "asciidocfx"                                   # asciidoc fx editor
cask "backuploupe"                                  # browse your timemachine backups
cask "calibre"                                      # e-book reader and library management application
cask "dropbox"                                      # personal cloud storage service
cask "expandrive"                                   # map a drive to any cloud
cask "flux-app"                                     # get rid of the blue light
cask "google-drive"                                 # client for the google drive storage service
cask "kdiff3"                                       # utility for comparing and merging files and directories
cask "keystore-explorer"                            # open source GUI replacement for the keytool and jarsigner
cask "keybase"                                      # crypto for everyone!
cask "keycastr"                                     # keystroke visualizer
cask "kui"                                          # a Framework for Enhancing CLIs with Graphics
cask "love"                                         # LÖVE - make 2D games in Lua
cask "visual-paradigm-ce"                           # software modelling tool
cask "visualvm"                                     # visual profiling tool for the Java VM
cask "xquartz"                                      # X windows on Mac
cask "yed"                                          # graph editor

### ---------------------------------------------------- ###
### Mac App Store (MAS)
### ---------------------------------------------------- ###
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "Twitter", id: 1482454543
mas "Microsoft To Do", id: 1274495053
mas "Vimari, Vimium for Safari", id: 1480933944
