
# To keep this file in sync I'm avoiding to install with the `brew install` command,
# instead I'm adding a row to this file and run 'brew bundle --global' to make sure it's working.

# https://github.com/Homebrew/homebrew-bundle
# Always run 'brew update' before running 'brew bundle'

#
# It's not always easy to understand how the dsl for bundle is constructed without reading the code.
# I know people have asked for clarification in the documentation but it has not been
# well received by {noname}. Haven't found any changelog either but heck, it's open source ;-)
#

def macos?
  RUBY_PLATFORM =~ /darwin/
end
def linux?
  RUBY_PLATFORM =~ /linux/
end
def arch_amd?
  RUBY_PLATFORM =~ /amd/
end
def arch_arm?
  RUBY_PLATFORM =~ /arm/
end

tap "homebrew/bundle"
tap "homebrew/cask-fonts"              # fonts
tap "homebrew/cask-versions"           # alternate versions of Casks
tap "merikan/tools"                    # my personal tap

### ---------------------------------------------------- ###
### Formulae                                             ###
### ---------------------------------------------------- ###
brew "act"                                          # run your github actions locally
brew "ansible"                                      # IaC provision and configure
brew "apktool"                                      # reverse engineering Android apk files
brew "argocd"                                       # GitOps continuous delivery tool for Kubernetes
brew "aria2"                                        # multi-protocol & multi-source command-line download utility
brew "asciinema"                                    # record and share terminal sessions
brew "bash"
brew "bash-completion"
brew "bat"                                          # a cat clone with syntax highlighting and git integration
brew "bitwarden-cli"                                # open source password management
brew "brew-cask-completion"
brew "ccat"                                         # colorizing cat
brew "merikan/tools/clair-scanner"                  # scan local docker images
brew "cloc"                                         # count lines of code
brew "cmake"                                        # cross-platform make
brew "cowsay"                                       # the cow says
brew "csvkit"                                       # tools for working with CSV
brew "ctop"                                         # top-like interface for container metrics
brew "cosign"                                       #
brew "curl"                                         # curl
brew "util-linux"                                   # linux utilities
brew "dasel"                                        # query and modify data structures in json/toml/yaml/xml/csv/plain format
brew "git-delta"                                    # syntax-highlighting pager for git, diff, and grep output
brew "joshuto"                                      # ranger-like terminal file manager written in Rust
brew "wvanlint/twf/twf"                             # tree view file explorer
brew "dfc"                                          # displays file system space usage using graphs and colors
brew "diff-pdf"                                     # visually compare two PDF files
brew "direnv"                                       # load/unload env variables
brew "wagoodman/dive/dive"                          # exploring a docker image, layer contents, and discovering ways to shrink your Docker image size.
brew "doxygen"                                      # Generate documentation from source code
brew "docker"                                       # docker client
brew "docker-credential-helper"                     # keystore credential helper for Docker
brew "ffmpeg"                                       # record, convert and stream audio and video
brew "ffmpegthumbnailer"                            # create thumbnails for your video files
brew "flake8"                                       # lint python
brew "fzf"                                          # a command-line fuzzy finder
brew "ffmpeg"                                       # to record, convert and stream audio and video
brew "merikan/tools/gdu-go"                         # go disk usage
brew "go"                                           # golang sdk
brew "gojq"                                         # jq written in go
brew "goreleaser/tap/goreleaser"                    # release automation tool for Go projects
brew "golangci-lint"                                # Go linters aggregator
brew "ghq"                                          # git remote repository management made easy
brew "gibo"                                         # easily accessing gitignore boilerplates
brew "git"                                          # cli client for git
brew "git-branchless"                               # some nice git commands
brew "git-flow-avh"                                 # git-flow addon for git client
brew "gitleaks"                                     # audit git repos for secrets
brew "git-secrets"                                  # prevents you from committing passwords and other sensitive information to a git repository.
brew "sigstore/tap/gitsign"                         # keyless sigstore to sign git commits
brew "gitui"                                        # an awesome tui for git
brew "gnupg"                                        # gpg
brew "go-task/tap/go-task"                          # task runner / build tool
brew "gron"                                         # make JSON greppable!
brew "anchore/grype/grype"                          # vulnerability scanner for container images and filesystems
brew "htop"                                         # an interactive process viewer for Unix
brew "httpie"                                       # HTTP command-line client
brew "hugo"                                         # open-source static site generator
brew "icdiff"                                       # improved colored diff
brew "imagemagick"                                  # create, edit, compose, or convert bitmap images
brew "java"                                         # java
brew "jaq"                                          # like jq but better, faster and more correct
brew "jenv"                                         # manage your java environment
brew "jid"                                          # drill down JSON interactively by using filtering queries like jq.
brew "jless"                                        # a command-line JSON viewer
brew "jq"                                           # command-line JSON processor, like sed
brew "jo"                                           # small utility to create JSON objects
brew "joplin-cli"                                   # note taking and to-do application
brew "boz/repo/kail"                                # kubernetes log viewer
brew "k9s"                                          # awesome tui for k8s
brew "kind"                                         # k8s in docker
brew "kompose"                                      # a conversion tool to go from Docker Compose to Kubernetes
brew "krew"                                         # package manager for kubectl plugins
brew "kubectl"                                      # kubernetes controller
brew "kubectx"                                      # kubectx: manage and switch between kubectl contexts, kubens: switch between Kubernetes namespaces.
brew "kubeconform"                                  # lint k8s manifests
brew "kube-linter"                                  # lint k8s and helm manifests
brew "helm"                                         # helm packagemanager for kubernetes
brew "kustomize"                                    # kustomize: template-free customization of application configuration
brew "kubespy"                                      # observing Kubernetes resources in real time
brew "johanhaleby/kubetail/kubetail"                # tail Kubernetes logs from multiple pods
brew "jesseduffield/lazydocker/lazydocker"          # the lazier way to manage everything docker
brew "jesseduffield/lazygit/lazygit"                # simple terminal UI for git commands
brew "k3d"                                          # k3d is a lightweight wrapper to run k3s
brew "k6"                                           # open-source load testing tool
brew "kubeaudit"                                    # audit k8s clusters and manifests
brew "lf"                                           # file manager for the terminal
brew "lnav"                                         # watch and analyze your log files from a terminal.
brew "lua"                                          # a powerful, efficient, lightweight, embeddable scripting language
brew "luarocks"                                     # lua package manager
brew "mackup"                                       # keep application settings in sync
brew "maven-completion"
brew "mas"                                          # Mac App Store command-line interface
brew "midnight-commander"                           # visual file manager
brew "minikube"                                     # kubernetes mini
brew "mplayer"                                      # UNIX movie player
brew "mysql-client"                                 # mysql client
brew "ncdu"                                         # a disk usage analyzer with an ncurses interface
brew "nmap"                                         # port scanning utility for large networks
brew "neofetch"                                     # A fast, highly customizable system info script
brew "neovim"                                       # neovim
brew "nativefier"                                   # Make any web page a desktop application
brew "nvm"                                          # manage multiple Node.js versions
brew "openconnect"                                  # open client for cisco anyconnect vpn
brew "openshift-cli"                                # openshift cli
brew "packer"                                       # package VMs
brew "packer-completion"
brew "php"                                          # php
brew "plantuml"                                     # draw UML diagrams
brew "pip-completion"
brew "poppler"                                      # pdf rendering library (based on the xpdf-3.0 code base)
brew "potrace"                                      # transforming bitmaps into vector graphics
brew "pv"                                           # a terminal-based tool for monitoring the progress of data through a pipeline.
brew "pyenv"                                        # simple python version management
brew "python"                                       # python programming
brew "reattach-to-user-namespace"                   # Reattach process (e.g., tmux) to background
brew "ripgrep"                                      # recursively searches directories for a regex pattern
brew "rsync"                                        # provides fast incremental file transfer.
brew "ruby"                                         # ruby environment
brew "rustup-init"                                  # rustup installer
brew "semgrep"                                      # static analysis, find bugs and enforce code standards
brew "scorecard"                                    # check OSS security health
brew "scrcpy"                                       # android screen mirror
brew "sheldon"                                      # fast, configurable, shell plugin manager
brew "shellcheck"                                   # a static analysis tool for shell scripts
brew "skaffold"                                     # local k8s development
brew "felixkratz/formulae/sketchybar"               # macOS status bar
brew "skopeo"                                       # work with container registry and images
brew "ssh-copy-id"                                  # ssh copy
brew "statix"                                       # linter for nix
brew "starship"                                     # blazing-fast cross-shell prompt
brew "stern"                                        # log tailing for Kubernetes
brew "stunnel"                                      # SSL tunneling program
brew "structurizr-cli"                              # cli for Structurizr DSL
brew "stylua"                                       # lua formatter
brew "go-task/tap/go-task"                          # a task runner / build tool, like Make but ....
brew "tealdeer"                                     # a fast tldr impl in rust with custom pages and patches
brew "the_silver_searcher"                          # ag a code searching tool similar to ack
brew "tig"                                          # text-mode interface for git
brew "tmux"                                         # terminal multiplexer
brew "toot"                                         # mastodon tui client
brew "tree"                                         # list contents of directories in a tree-like format
brew "aquasecurity/trivy/trivy"                     # scanner for vulnerabilities in images, filesystems, git repos and config files
brew "tut"                                          # mastodon tui client
brew "unar"                                         # command-line unarchiving tools supporting multiple formats
brew "vim"                                          # highly configurable text editor
brew "watch"                                        # execute a program periodically and watch the output
brew "wget"                                         # non-interactive network downloader
brew "xdg-ninja"                                    # xdg checks your $HOME for unwanted files and directories.
brew "xsv"                                          # A fast csv command line toolkit written in Rust.
brew "yarn"                                         # JavaScript package manager
brew "yazi"                                         # blazing fast terminal file manager
brew "yt-dlp"                                       # download videos from youtube and many more sites
brew "yq"                                           # fast yaml processor
brew "vmware-tanzu/carvel/ytt"                      # YAML templating tool, structure instead of text
brew "zellij"                                       # an awesome terminal multiplexer
brew "zoxide"                                       # a smarter cd command
brew "zsh"                                          # shell

### ---------------------------------------------------- ###
### Casks (https://formulae.brew.sh/cask/)               ###
### ---------------------------------------------------- ###
# Note: Casks with version 'latest' will not be updated due to no checksum change
cask "adium"                                        # instant messaging
cask "alacritty"                                    # the GPU enhanced terminal emulator
cask "alt-tab"                                      # awesome keyboard window switcher for Mac
cask "alfred"                                       # a must have for boost productivity
cask "android-studio"                               # android IDE
cask "android-file-transfer"                        # transfer files from Android device
cask "arq"                                          # backup for mac
cask "backuploupe"                                  # browse your timemachine backups
cask "balenaetcher"                                 # Burn images to SD cards & USB drives, safely and easily.
cask "bartender"                                    # organize your menu bar icons
cask "bitwarden"                                    # open source password management
cask "brave-browser"                                # privacy focused, performance oriented browser
cask "calibre"                                      # e-book reader and library management application
cask "clementine"                                   # music player and radio streamer
cask "chromium"                                     # open-source browser
cask "cyberduck"                                    # client for FTP and SFTP, WebDAV, and cloud storage
cask "dash"                                         # API documentation browser
cask "dbeaver-community"                            # universal database tool
cask "discord"                                      # group-chatting platform
cask "dropbox"                                      # personal cloud storage service
cask "eclipse-java"                                 # eclipse ide for java developers
cask "evernote"                                     # taking notes
cask "expandrive"                                   # map a drive to any cloud
cask "flux"                                         # get rid of the blue light
cask "firefox"                                      # firefox browser
cask "firefox-developer-edition"                    # firefox browser
cask "flutter"                                      # ui toolkit for flutter
cask "gimp"                                         # an Image Editor (I probably never be able to learn)
cask "gitkraken"                                    # Git GUI client for Windows, Mac and Linux
cask "gitup"                                        # awesome Git Gui Client
cask "google-chrome"                                # a browser
cask "hammerspoon"                                  # powerful automation of MacOS, actions and wm
cask "handbrake"                                    # open source video transcoder
cask "horos"                                        # a free, open source medical image viewer
cask "inkscape"                                     # A powerful, free design tool
cask "insomnia"                                     # superduper rest client
cask "intellij-idea"                                # awesome java IDE
cask "iterm2"                                       # Terminal emulator for macOS
cask "jdiskreport"                                  # analyses your disk drives and shows charts and details tables
cask "joplin"                                       # a FOSS note taking and to-do application
cask "karabiner-elements"                           # keyboard customizer for macOS
cask "kdiff3"                                       # utility for comparing and merging files and directories
cask "keepassxc"                                    # a great FOSS Password Manager
cask "keystore-explorer"                            # open source GUI replacement for the keytool and jarsignerbrewfilbrewfil
cask "keybase"                                      # crypto for everyone!
cask "keycastr"                                     # keystroke visualizer
cask "kui"                                          # a Framework for Enhancing CLIs with Graphics
cask "love"                                         # LÖVE - make 2D games in Lua
cask "markright"                                    # a markdown editor
cask "merikan/casks/maconomy"                       # nativefied maconomy
cask "messenger"                                    # facebook messenger
cask "minishift"                                    # openshift mini
cask "mitmproxy"                                    # a free and open source interactive HTTPS proxy
cask "obs"                                          # foss for video recording and live streaming
cask "opera"                                        # browser
cask "mysqlworkbench"                               # gui tool for mysql
cask "paintbrush"                                   # clean and simple paint program
cask "pencil"                                       # open-source GUI prototyping tool
cask "phoenix-slides"                               # image viewer
cask "postman"                                      # nice rest client
cask "qownnotes"                                    # nice rest client
cask "raycast"                                      # supercharged productivity
cask "rancher"                                      # OSS alternative to Docker Desktop
cask "responsively"                                 # modified web browser for responsive web development
cask "skype"                                        # video conf
cask "sketch"                                       # sketchapp - design tool
cask "sketch-toolbox"                               # some useful plugins for sketchapp
cask "skitch"                                       # take screenshots of all or part of your screen
cask "sloth"                                        # shows all open files and sockets
cask "sonos"                                        # Sonos controller
cask "soapui"                                       # soap and rest testing tool
cask "sonos"                                        # controller for sonos speakers
cask "sourcetree"                                   # awesome git client
cask "spotify"                                      # music for everyone
cask "merikan/casks/sr"                             # nativefied sveriges radio
cask "sublime-text"                                # text editor
cask "thunderbird"                                  # free email application from Mozilla
cask "tomatobar"                                    # another pomodoro app
cask "tunnelblick"                                  # free, open source graphic user interface for OpenVPN
cask "vagrant"                                      # vm management
brew "vagrant-completion"
if arch_amd?
  cask "virtualbox"                                   # virtualizer for x86 hardware
end
if arch_arm?
  cask "virtualbox-beta"                            # virtualizer for arm hardware
end
cask "visual-paradigm-ce"                           # software modelling tool
cask "visual-studio-code"                           # a great editor
cask "visualvm"                                     # visual profiling tool for the Java VM
cask "vivaldi"                                      # another great browser
cask "vlc"                                          # media player
cask "vscodium"                                     # open source version of VSCode
cask "wavebox"                                      # desktop app for web (gmail)
cask "whalebird"                                    # mastodon client
cask "xbar"                                         # put the output from any script or program in your Mac OS X Menu Bar
cask "xquartz"                                      # X windows on Mac
cask "yed"                                          # graph editor
cask "zoom"                                         # video communications

## quick-look-plugins see:https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"                                  # preview source code files with syntax highlighting
cask "qlstephen"                                    # preview plain text files without or with unknown file extension.
cask "qlmarkdown"                                   # preview Markdown files
cask "quicklook-json"                               # preview JSON files
cask "betterzip"                                    # preview archives
cask "quicklook-csv"                                # preview CSV files
cask "qlimagesize"                                  # display image size and resolution
cask "webpquicklook"                                # preview WebP images
cask "suspicious-package"                           # preview the contents of a standard Apple installer package
cask "qlvideo"                                      # display thumbnails, static previews, cover art and metadata for video files
## -- fonts
cask "font-3270"                                    # a font for the nostalgic
cask "font-3270-nerd-font"                          # nerd patched '3270' font
cask "font-fira-code"                               # monospaced font with programming ligatures
cask "font-fira-code-nerd-font"                     # nerd patched 'fire-code' font
cask "font-go"                                      # golang fonts
cask "font-go-mono-nerd-font"                       # nerd patched 'go-mono' font
cask "font-hasklig"                                 # a code font with monospaced ligatures
cask "font-hasklug-nerd-font"                       # nerd patched 'hasklig' font
cask "font-inconsolata"                             # a great programmers font
cask "font-inconsolata-nerd-font"                   # nerd patched 'inconsolata' font
cask "font-jetbrains-mono"                          # a typeface made for developers.
cask "font-jetbrains-mono-nerd-font"                # nerd patched 'jetbrains-mono' font
cask "font-monoid"                                  # a ppen source coding font with ligatures
cask "font-monoid-nerd-font"                        # nerd patched 'monoid' font
cask "font-monoisome"                               # monoid with Font Awesome support

### ---------------------------------------------------- ###
### Mac App Store command line interface                 ###
### https://github.com/mas-cli/mas                       ###
### ---------------------------------------------------- ###

mas "Bredbandskollen", id: 1147976909
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "Twitter", id: 1482454543
mas "Microsoft To Do", id: 1274495053
mas "Vimari, Vimium for Safari", id: 1480933944
